# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
















#Your code here
import sqlite3
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

In [2]:
c.execute("SELECT name FROM sqlite_master WHERE type='table';").fetchall()

[('orderdetails',),
 ('payments',),
 ('offices',),
 ('customers',),
 ('orders',),
 ('productlines',),
 ('products',),
 ('employees',)]

In [3]:
import pandas as pd
df = pd.read_sql("""SELECT * FROM orderdetails""", con=conn)
df.head()

  orderNumber productCode quantityOrdered priceEach orderLineNumber
0       10100    S18_1749              30    136.00               3
1       10100    S18_2248              50     55.09               2
2       10100    S18_4409              22     75.46               4
3       10100    S24_3969              49     35.29               1
4       10101    S18_2325              25    108.06               4

In [4]:
c.execute("PRAGMA table_info(orderdetails)").fetchall()

[(0, 'orderNumber', '', 0, None, 0),
 (1, 'productCode', '', 0, None, 0),
 (2, 'quantityOrdered', '', 0, None, 0),
 (3, 'priceEach', '', 0, None, 0),
 (4, 'orderLineNumber', '', 0, None, 0)]

In [5]:
c.execute("PRAGMA table_info(payments)")
info = c.fetchall()
print(*info, sep = "\n")

(0, 'customerNumber', '', 0, None, 0)
(1, 'checkNumber', '', 0, None, 0)
(2, 'paymentDate', '', 0, None, 0)
(3, 'amount', '', 0, None, 0)

In [6]:
c.execute("PRAGMA table_info(offices)")
info = c.fetchall()
print(*info, sep = "\n")

(0, 'officeCode', '', 0, None, 0)
(1, 'city', '', 0, None, 0)
(2, 'phone', '', 0, None, 0)
(3, 'addressLine1', '', 0, None, 0)
(4, 'addressLine2', '', 0, None, 0)
(5, 'state', '', 0, None, 0)
(6, 'country', '', 0, None, 0)
(7, 'postalCode', '', 0, None, 0)
(8, 'territory', '', 0, None, 0)

In [7]:
c.execute("PRAGMA table_info(customers)")
info = c.fetchall()
print(*info, sep = "\n")

(0, 'customerNumber', '', 0, None, 0)
(1, 'customerName', '', 0, None, 0)
(2, 'contactLastName', '', 0, None, 0)
(3, 'contactFirstName', '', 0, None, 0)
(4, 'phone', '', 0, None, 0)
(5, 'addressLine1', '', 0, None, 0)
(6, 'addressLine2', '', 0, None, 0)
(7, 'city', '', 0, None, 0)
(8, 'state', '', 0, None, 0)
(9, 'postalCode', '', 0, None, 0)
(10, 'country', '', 0, None, 0)
(11, 'salesRepEmployeeNumber', '', 0, None, 0)
(12, 'creditLimit', '', 0, None, 0)

In [8]:
c.execute("PRAGMA table_info(orders)")
info = c.fetchall()
print(*info, sep = "\n")

(0, 'orderNumber', '', 0, None, 0)
(1, 'orderDate', '', 0, None, 0)
(2, 'requiredDate', '', 0, None, 0)
(3, 'shippedDate', '', 0, None, 0)
(4, 'status', '', 0, None, 0)
(5, 'comments', '', 0, None, 0)
(6, 'customerNumber', '', 0, None, 0)

In [9]:
c.execute("PRAGMA table_info(productlines)")
info = c.fetchall()
print(*info, sep = "\n")

(0, 'productLine', '', 0, None, 0)
(1, 'textDescription', '', 0, None, 0)
(2, 'htmlDescription', '', 0, None, 0)
(3, 'image', '', 0, None, 0)

In [10]:
c.execute("PRAGMA table_info(products)")
info = c.fetchall()
print(*info, sep = "\n")

(0, 'productCode', '', 0, None, 0)
(1, 'productName', '', 0, None, 0)
(2, 'productLine', '', 0, None, 0)
(3, 'productScale', '', 0, None, 0)
(4, 'productVendor', '', 0, None, 0)
(5, 'productDescription', '', 0, None, 0)
(6, 'quantityInStock', '', 0, None, 0)
(7, 'buyPrice', '', 0, None, 0)
(8, 'MSRP', '', 0, None, 0)

In [11]:
c.execute("PRAGMA table_info(employees)")
info = c.fetchall()
print(*info, sep = "\n")

(0, 'employeeNumber', '', 0, None, 0)
(1, 'lastName', '', 0, None, 0)
(2, 'firstName', '', 0, None, 0)
(3, 'extension', '', 0, None, 0)
(4, 'email', '', 0, None, 0)
(5, 'officeCode', '', 0, None, 0)
(6, 'reportsTo', '', 0, None, 0)
(7, 'jobTitle', '', 0, None, 0)

In [17]:
c.execute("""select firstName, lastName,
                      productName
                      from employees e
                      join
                      customers c
                      on e.employeeNumber = c.salesRepEmployeeNumber
                      join orders o
                      using(customerNumber)
                      join orderdetails od
                      using(orderNumber)
                      join products p
                      using(productCode)""")
df = pd.DataFrame(c.fetchall())
print(len(df))
df.head()

2996

        0         1                                            2
0  Leslie  Jennings                               1958 Setra Bus
1  Leslie  Jennings                       1940 Ford Pickup Truck
2  Leslie  Jennings                      1939 Cadillac Limousine
3  Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie  Jennings                            1968 Ford Mustang

In [18]:
df.groupby([0,1]).count()

                      2
0        1
Andy     Fixter     185
Barry    Jones      220
Foon Yue Tseng      142
George   Vanauf     211
Gerard   Hernandez  396
Julie    Firrelli   124
Larry    Bott       236
Leslie   Jennings   331
         Thompson   114
Loui     Bondur     177
Mami     Nishi      137
Martin   Gerard     114
Pamela   Castillo   272
Peter    Marsh      185
Steve    Patterson  152

## Display the names of all the employees in Boston.
Hint: join the employees and customers tables.

In [12]:
# pd.read_sql("""SELECT DISTINCT firstName, lastName from employees
#                         join customers
#                         on officeCode = officeCode WHERE city="Boston";""", conn)

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [13]:
#Your code here
pd.read_sql("""SELECT offices.officeCode, Count(employeeNumber) FROM employees
                       left join offices
                        on employees.officeCode = offices.officeCode GROUP BY offices.officeCode;""", conn)

  officeCode  Count(employeeNumber)
0          1                      6
1          2                      2
2          3                      2
3          4                      5
4          5                      2
5          6                      4
6          7                      2

## Write 3 Questions of your own and answer them

In [14]:
# Answers will vary

In [42]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [ ]:
# Your code here

#Your code here
pd.read_sql("""SELECT DISTINCT product, employeeNumber FROM employees
                       left join product
                        on employees.officeCode = offices.officeCode GROUP BY offices.officeCode;""", conn)

## Level Up: Display the Number of Products each employee has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!